Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Current line colour
zh_cn: 当前行颜色

source: Current result was
zh_cn: 目前的结果是

source: Cursor Error
zh_cn: 光标错误

source: Cursor: {0},{1}
zh_cn: 光标： {0},{1}

source: Custom
zh_cn: 自定义

source: Custom Colours:
zh_cn: 自定义颜色：

source: Cut
zh_cn: 剪切

source: Cut Event
zh_cn: 剪切事件

source: Cut Frame
zh_cn: 剪切帧

source: Cut Gadget
zh_cn: 剪切部件

source: Cut Selection
zh_cn: 剪切所选

source: Cut any selected actions to the clipboard
zh_cn: 将所选动作剪切到剪贴板上

source: Cut any selected events to the clipboard
zh_cn: 将所选事件剪切到剪贴板上

source: Cut any selected text to the clipboard
zh_cn: 将所选文本剪切到剪贴板上

source: Cut selected items from the current layer
zh_cn: 从当前层剪切所选项

source: Cut selected moments from the timeline
zh_cn: 从时间轴中剪切所选时刻

source: Cut selection
zh_cn: 剪切选区

source: Cycle tiles
zh_cn: 循环图块

source: D&D Script Example
zh_cn: D&D脚本样例

source: D&D Script Return Example
zh_cn: D&D脚本返回样例

source: D&D Script editor
zh_cn: D&D脚本编辑器

source: D-Pad Down
zh_cn: 十字键 下

source: D-Pad Left
zh_cn: 十字键 左

source: D-Pad Right
zh_cn: 十字键 右

source: D-Pad Up
zh_cn: 十字键 上

source: DOWNLOADING
zh_cn: 下载中

source: DPI override changes requires a restart of the IDE.
zh_cn: DPI 改写的变动需要重新启动 IDE。

source: DX11 based graphics card
zh_cn: 基于DX11的显卡

source: DX11 compliant graphics card
zh_cn: 兼容DX11的显卡

source: Damping is also much cheaper to simulate than friction, but please note that damping is not a replacement for friction; the two effects can, and should, be used together.
zh_cn: 模拟阻尼比摩擦要便宜得多，但请注意，阻尼不是摩擦的替代品;这两个效果可以而且应该一起使用。

source: Damping is used to reduce the physics world velocity of an instance, and differs from friction in that friction only occurs when two instances with collision shapes (fixtures) are in contact.
zh_cn: 阻尼用于降低实例的物理世界速度，并且与摩擦不同，因为摩擦力仅在碰撞形状（弹性）的两个实例接触时才发生。

source: Dark
zh_cn: 暗

source: Data Structures
zh_cn: 数据结构

source: Data Type Constant
zh_cn: 缓冲区类型常量

source: Data Types
zh_cn: 数据类型

source: Data_Structures
zh_cn: 数据结构

source: Date
zh_cn: 日期

source: Date and Time
zh_cn: 日期和时间

source: Date:
zh_cn: 日期：

source: Deadzone
zh_cn: 死区

source: Debug
zh_cn: 调试

source: Debug (F6)
zh_cn: 调试 (F6)

source: Debug Events - Tick {0}
zh_cn: 调试事件 - 勾选 {0}

source: Debug Info
zh_cn: 调试信息

source: Debug Module
zh_cn: 调试模块

source: Debugger
zh_cn: 调试器

source: Debugger Connection String
zh_cn: 调试器连接字符串

source: Debugger Version Error
zh_cn: 调试器版本错误

source: Debugger colour
zh_cn: 调试器颜色

source: Debugger port
zh_cn: 调试器端口

source: Debugging
zh_cn: 正在调试

source: Decimal
zh_cn: 小数

source: Decimal To Integer
zh_cn: 小数转整数

source: Declare Temp
zh_cn: 声明临时变量

source: Declare a temporary variable.
zh_cn: 声明一个临时变量

source: Decrease brush size
zh_cn: 减小画刷尺寸

source: Decrease current brush size
zh_cn: 减小当前画刷大小

source: Decrease playback speed
zh_cn: 减慢播放速度

source: Decrease size of current brush with smoothing (interpolation)
zh_cn: 减小当前带有平滑（插值）的画刷大小

source: Decrease the font size in any of the code editors
zh_cn: 减小所有代码编辑器的字体大小

source: Default
zh_cn: 默认

source: Default Audio Device
zh_cn: 默认音频设备

source: Default Event Comment
zh_cn: 默认事件评论

source: Default Label Colour
zh_cn: 默认标签颜色

source: Default Package Architecture
zh_cn: 默认包架构

source: Default Packaging Type
zh_cn: 默认打包类型

source: Default Team Identifier
zh_cn: 默认团队标识符

source: Default animation mode for new sprites
zh_cn: 新的精灵的默认动画模式

source: Default background colour
zh_cn: 默认背景颜色

source: Default background layer colour
zh_cn: 默认背景层颜色

source: Default choice for File Deletion
zh_cn: 删除文件的默认选项

source: Default choice for Proxy File Deletion
zh_cn: 删除代理文件时的默认选项

source: Default choice for resetting the project layout
zh_cn: 重置项目布局时进行默认选择

source: Default code window height
zh_cn: 默认代码窗口高度

source: Default code window width
zh_cn: 默认代码窗口宽度

source: Default colour is $039D5BFF.
zh_cn: 默认颜色为 $039D5BFF.

source: Default colour is $3E3E3EFF.
zh_cn: 默认颜色为 $3E3E3EFF.

source: Default colour is $666666FF.
zh_cn: 默认颜色为 $666666FF.

source: Default colour is $99DD00 with an alpha of 153 ($99).
zh_cn: 默认颜色为$99DD00，透明度为153（$99）

source: Default colour is (rgba) #808080ff.
zh_cn: 默认值为(RGBA颜色) #808080ff。

source: Default colour is (rgba) #c3c3c3ff.
zh_cn: 默认值为(RGBA颜色) #c3c3c3ff。

source: Default draw colour
zh_cn: 默认绘制颜色

source: Default event content
zh_cn: 默认事件内容

source: Default for DnD™ conversion to GameMaker Language
zh_cn: 默认 DnD™ 转换为 GML

source: Default for DnD™ node deletion
zh_cn: DnD™ 节点删除的默认值

source: Default for Exit Confirmation
zh_cn: 退出确认时默认

source: Default for automatically updating layer depths
zh_cn: 默认自动更新层深度

source: Default for closing non-empty workspace tabs using keyboard shortcut
zh_cn: 使用快捷键关闭非空工作区标签页时的默认处理

source: Default for committing changes on tool change
zh_cn: 默认工具更改时提交更改

source: Default for deleting event
zh_cn: 默认删除事件

source: Default for deleting frames
zh_cn: 默认删除帧

source: Default for file import
zh_cn: 导入文件时默认

source: Default for opening multiple resources
zh_cn: 默认打开多个资源

source: Default for parent room item deletion
zh_cn: 默认删除父房间项目

source: Default for parent room layer deletion
zh_cn: 默认删除父房间层

source: Default for replacing images during strip import
zh_cn: 长带图导入时默认替换图片

source: Default for resource deletion
zh_cn: 默认删除资源

source: Default for restarting a running build
zh_cn: 重新运行生成项时的默认处理

source: Default for room item deletion
zh_cn: 默认删除房间项目

source: Default for room layer deletion
zh_cn: 默认删除房间层

source: Default for setting a room parent by dragging underneath
zh_cn: 默认通过拖到到下方设置一个父房间

source: Default group cannot be deleted.
zh_cn: 默认组不能删除。

source: Default icon colour
zh_cn: 默认图标颜色

source: Default is "Block Pattern".
zh_cn: 默认选项是“方块图案”

source: Default is "Show message".
zh_cn: 默认选项为“显示消息”（Show message）。

source: Default is (rgba) ##AAFF3333.
zh_cn: 默认颜色是（rgba）##AAFF3333。

source: Default is (rgba) ##AAFFFFFF.
zh_cn: 默认是（rgba）##AAFFFFFF。

source: Default is (rgba) #00000000.
zh_cn: 默认是（rgba）#00000000。

source: Default is (rgba) #00A4FFFF.
zh_cn: 默认值是（rgba）#00A4FFFF。

source: Default is (rgba) #00FF00FF.
zh_cn: 默认值为（RGBA颜色） #00FF00FF.

source: Default is (rgba) #00FFFFFF.
zh_cn: 默认值为（RGBA颜色） #00FFFFFF.

source: Default is (rgba) #404040FF.
zh_cn: 默认值为（RGBA颜色） #404040FF。

source: Default is (rgba) #800000FF.
zh_cn: 默认值是（rgba）#800000FF。

source: Default is (rgba) #C0C0C0FF.
zh_cn: 默认值是（rgba）#C0C0C0FF。

source: Default is (rgba) #FF000050.
zh_cn: 默认是（rgba）#FF000050。

source: Default is (rgba) #FF0000FF.
zh_cn: 默认值为（RGBA颜色） #FF0000FF。

source: Default is (rgba) #FFA400FF.
zh_cn: 默认值是（rgba）#FFA400FF。

source: Default is (rgba) #FFFFFFFF.
zh_cn: 默认值是（rgba）#FFFFFFFF。

source: Default is -1.
zh_cn: 默认值为-1。

source: Default is 0.001.
zh_cn: 默认是0.001。

source: Default is 0.3.
zh_cn: 默认是0.3。

source: Default is 10.
zh_cn: 默认值为10。

source: Default is 100%.
zh_cn: 默认值为100%

source: Default is 100px.
zh_cn: 默认100像素。

source: Default is 1024px.
zh_cn: 默认是1024像素。

source: Default is 10px.
zh_cn: 默认值为10像素。

source: Default is 15%.
zh_cn: 默认值为15%

source: Default is 16px, with a minimum value of 2px and a maximum of 256px permitted.
zh_cn: 默认为16像素，并允许最小值为2像素，最大值为256像素。

source: Default is 20px.
zh_cn: 默认20px。

source: Default is 250%.
zh_cn: 默认值为250％。

source: Default is 35%.
zh_cn: 默认值为35%。

source: Default is 350.
zh_cn: 默认值为350。

source: Default is 4.
zh_cn: 默认是4。

source: Default is 50%.
zh_cn: 默认值为50％。

source: Default is 6000.
zh_cn: 默认为6000。

source: Default is 768px.
zh_cn: 默认是768像素。

source: Default is 8px;
zh_cn: 默认8px。

source: Default is #000000FF.
zh_cn: 默认值为#000000FF.

source: Default is English.
zh_cn: 默认为英语。

source: Default is disabled.
zh_cn: 默认禁用。

source: Default is enabled.
zh_cn: 默认启用。

source: Default is off.
zh_cn: 默认为关。

source: Default is on, which will maintain any tabs set on a line when a new line is added.
zh_cn: 默认开启，添加新行时将保持缩进。

source: Default is on, which will tab the next line of code when a new brace { and a new line are added.
zh_cn: 默认开启，当新的括号 { 和新的行被添加时，它将标记下一行代码。

source: Default is on.
zh_cn: 默认开启。

source: Default layer depth spacing
zh_cn: 默认层深度间距

source: Default loop mode
zh_cn: 默认循环模式

source: Default origin for new sprites
zh_cn: 新的精灵的默认原点

source: Default package architecture
zh_cn: 默认程序包架构

source: Default packaging type
zh_cn: 默认程序包类型

source: Default room height
zh_cn: 默认房间高度

source: Default room width
zh_cn: 默认房间宽度

source: Default size for DnD™ toolbox action thumbnails
zh_cn: DnD™工具栏动作缩略图的默认尺寸

source: Default sprite animation mode
zh_cn: 默认精灵动画模式

source: Default sprite collision mask kind
zh_cn: 默认精灵碰撞盒类型

source: Default sprite height
zh_cn: 默认精灵高度

source: Default sprite origin
zh_cn: 默认精灵原点

source: Default sprite width
zh_cn: 默认精灵宽度

source: Default team identifier
zh_cn: 默认团队标识符

source: Default value is "Show Message".
zh_cn: 默认是“显示信息”。

source: Default value is 200.
zh_cn: 默认值为 200。

source: Default value is 300.
zh_cn: 默认值为 300。

source: Default value is 32px.
zh_cn: 默认值32像素。

source: Default value is 600.
zh_cn: 默认值为 600。

source: Default value is 64.
zh_cn: 默认值为64。

source: Default value is 900.
zh_cn: 默认值为 900。

source: Default zoom (%)
zh_cn: 默认缩放 (%)

source: Define a global compile-time macro.
zh_cn: 定义一个全局的预编译宏常量。

source: Degree range for keyboard window search
zh_cn: 使用键盘浏览窗口时的角度范围

source: Delete
zh_cn: 删除

source: Delete All
zh_cn: 删除全部

source: Delete All Breakpoints
zh_cn: 删除所有断点

source: Delete Anim
zh_cn: 删除动画

source: Delete Animation
zh_cn: 删除动画

source: Delete Asset Cache
zh_cn: 删除资产缓存

source: Delete Breakpoint
zh_cn: 删除断点

source: Delete Buffer
zh_cn: 删除缓冲区

source: Delete Current
zh_cn: 删除当前

source: Delete Event
zh_cn: 删除事件

source: Delete Event on Room Changes
zh_cn: 房间更改时删除事件

source: Delete Events
zh_cn: 删除事件

source: Delete File
zh_cn: 删除文件

source: Delete Gadget
zh_cn: 删除部件

source: Delete IDE Cache
zh_cn: 删除IDE缓存

source: Delete Layer
zh_cn: 删除层

source: Delete Layer/Group For All Frames
zh_cn: 删除所有帧的图层或组

source: Delete Layout
zh_cn: 删除布局

source: Delete Local Content?
zh_cn: 删除本地内容？

source: Delete Moments
zh_cn: 删除时刻点

source: Delete Path
zh_cn: 删除路径

source: Delete Points
zh_cn: 删除点

source: Delete Remote
zh_cn: 删除远程库（remote）

source: Delete Selected Frames
zh_cn: 删除选定帧

source: Delete Selected Layers
zh_cn: 删除选中的层

source: Delete Selected Set
zh_cn: 删除所选图块集

source: Delete Selection
zh_cn: 删除所选

source: Delete Temp Folder
zh_cn: 删除临时目录

source: Delete Watch
zh_cn: 删除监视变量

source: Delete a buffer.
zh_cn: 删除一个缓冲区。

source: Delete a file.
zh_cn: 删除一个文件。

source: Delete a joint from the physics world.
zh_cn: 从物理世界中删除关节

source: Delete all selected actions
zh_cn: 删除所选动作

source: Delete asset cache
zh_cn: 删除资源缓存

source: Delete asset cache on quit
zh_cn: 退出时删除资源缓存

source: Delete current view
zh_cn: 删除当前视图

source: Delete currently focused object editor item
zh_cn: 删除当前所选的物体编辑器项目

source: Delete group
zh_cn: 删除组

source: Delete layer(s)
zh_cn: 删除层

source: Delete local content for this asset.
zh_cn: 删除此资产的本地内容。

source: Delete selected moments from the timeline
zh_cn: 从时间轴中删除一个时刻

source: Delete selected range
zh_cn: 删除选定的范围

source: Delete temp folder
zh_cn: 删除临时文件夹

source: Delete temp folder on quit
zh_cn: 退出时删除临时文件夹

source: Delete the current focused auto-tile or animation set
zh_cn: 删除当前被聚焦的自动图块或动画集

source: Delete the selected frames
zh_cn: 删除所选帧

source: Delete the selected frames in the frame view
zh_cn: 删除帧视图中所选帧

source: Delete the selected frames?
zh_cn: 是否删除选中的帧？

source: Delete the selected resource(s)
zh_cn: 删除所选资源

source: Delete the selected view: {0}?
zh_cn: 删除所选视j野：{0}？

source: Deleting Runtime...
zh_cn: 正在删除运行库...

source: Deleting configuration '{0}' will also delete the following configurations: '{1}'.
zh_cn: 删除配置 '{0}' 的同时也会删除下面的配置： '{1}'.

source: Deleting moments is a permanent action that cannot be undone.
zh_cn: 删除时刻点是一个不能撤消的永久性操作。

source: Demos
zh_cn: 演示项目

source: Density
zh_cn: 密度

source: Depth
zh_cn: 深度

source: Depth ordering is from highest to lowest, so that the lower the depth the nearer the "camera" and the higher the depth the further away.
zh_cn: 深度排序是从最高到最低，所以深度越接近“相机”，深度越远。

source: Description
zh_cn: 描述

source: Description:
zh_cn: 描述：

source: Deselect selected tiles
zh_cn: 解选所选图块

source: Desktop
zh_cn: 桌面端

source: Desktop Shortcuts
zh_cn: 桌面快捷方式

source: Desktop Stretch
zh_cn: 桌面拉伸

source: Desktop Stretch - The background will cover the whole workspace, regardless of any visible docks
zh_cn: 桌面拉伸 - 该背景图将会覆盖整个工作区，无视所有可见的停靠栏。

source: Destination Width
zh_cn: 目标宽度

source: Destroy
zh_cn: 销毁

source: Destroy At Position
zh_cn: 定点销毁

source: Destroy Event
zh_cn: 销毁事件

source: Destroy Instance
zh_cn: 销毁实例

source: Destroy Particle Emitter
zh_cn: 销毁粒子发射器

source: Destroy Particle System
zh_cn: 销毁粒子系统

source: Destroy Particle Type
zh_cn: 销毁粒子类型

source: Destroy a particle emitter.
zh_cn: 销毁一个粒子发射器。

source: Destroy all instances at a position.
zh_cn: 销毁在某一位置上的所有实例。

source: Destroy an instance and remove it from the room.
zh_cn: 销毁一个实例并从房间里删除。

source: Destroy event
zh_cn: 销毁事件

source: Destroy the particle system.
zh_cn: 销毁这个粒子系统。

source: Destroy the particle type.
zh_cn: 销毁粒子类型。

source: Destroys a given emitter in the given particle system.
zh_cn: 销毁位于指定粒子系统中的指定发射器。

source: Destroys all emitters in the given particle system.
zh_cn: 销毁指定粒子系统中的所有发射器。

source: Details
zh_cn: 细节

source: Detect Browsers
zh_cn: 检测浏览器

source: Detect Device
zh_cn: 检测设备

source: Detect Devices
zh_cn: 检测设备

source: Detected a {0} Steam App ID: The Steam App ID is now in one place - Main Options, please ensure it is correct
zh_cn: 检测到{0} Steam App ID：Steam App ID 现在位于一个位置 - 主要选项，请确保其正确无误

source: Detecting Devices...
zh_cn: 正在检测设备......

source: Detecting devices...
zh_cn: 检测设备...

source: Developer
zh_cn: 开发者

source: Developer Package
zh_cn: 开发者程序包

source: Device
zh_cn: 设备

source: Device Editor
zh_cn: 设备编辑器

source: Device GUID:
zh_cn: 设备GUID:

source: Device ID mismatch
zh_cn: 设备ID不匹配

source: Device IP Required
zh_cn: 设备IP必需

source: Device Manager
zh_cn: 设备管理器

source: Device Manager Error
zh_cn: 设备管理器错误

source: Device Status:
zh_cn: 设备状态：

source: Device Support
zh_cn: 设备支持

source: Device Type:
zh_cn: 设备类型

source: Device id differs
zh_cn: 设备id不同

source: Device:
zh_cn: 设备：

source: Dialog Editor
zh_cn: 对话框编辑器

source: Dialog Editor: Duplicate Layout Name
zh_cn: 对话框编辑器：复制布局名称

source: Dialog Editor: Failed to open .json file: '{0}'
zh_cn: 对话框编辑器： 打开.json 文件 '{0}'失败

source: Dialog Editor: No JSON File Selected
zh_cn: 对话框编辑器：没有选择的JSON文件

source: Dialog Editor: No Layout Selected
zh_cn: 对话框编辑器：没有选择的布局

source: Dialog Editor: No XML File Selected
zh_cn: 对话框编辑器：没有选择的XML文件

source: Dialog Editor: Save failed due to error: {0} - {1}
zh_cn: 对话框编辑器：由于错误导致保存失败：{0} - {1}

source: Diamond
zh_cn: 菱形

source: Diamond (Slow)
zh_cn: 菱形 (慢)

source: Diff
zh_cn: 差异

source: Diff Tool Options
zh_cn: 差异工具（Diff Tool）选项

source: Diff Tool path is invalid
zh_cn: 差异工具路径无效

source: Digits
zh_cn: 数字

source: Direction
zh_cn: 方向

source: Directional Input
zh_cn: 方向输入

source: Directions
zh_cn: 方向

source: Directory
zh_cn: 目录

source: Disable
zh_cn: 禁用

source: Disable IDE transition animations
zh_cn: 禁用IDE过渡动画

source: Disable Source Sprite Export
zh_cn: 禁止源精灵导出

source: Disabled
zh_cn: 禁用

source: Discard the collected data and end the debugging session.
zh_cn: 丢弃收集的数据并结束调试会话。

source: Disk
zh_cn: 圆盘

source: Dismiss dragging resources into a locked or invisible layer error
zh_cn: 忽略拖拽资源到锁定或不可层的错误

source: Dismiss dragging resources with multiple or no selected layers error
zh_cn: 忽略拖拽多个资源或未选中层的错误

source: Dismiss group selected warning
zh_cn: 忽略组选中警告

source: Dismiss invalid resource dragged into room error
zh_cn: 忽略无效资源拖拽到房间的错误

source: Dismiss item locked warning
zh_cn: 解除项目锁定警告

source: Dismiss item's owner layer locked warning
zh_cn: 解除项所属层锁定警告

source: Dismiss layer is locked warning
zh_cn: 忽略层锁定警告

source: Dismiss layer locked warning
zh_cn: 解除层锁定警告

source: Display
zh_cn: 显示

source: Display "Running outside server" alert
zh_cn: 显示 "运行外部服务器" 警报

source: Display Argument Descriptions in status bar
zh_cn: 状态栏显示参数描述

source: Display Argument Types in status bar
zh_cn: 状态栏显示参数类型

source: Display Cursor
zh_cn: 显示鼠标

source: Display Cursor when Touchpad Active
zh_cn: 触摸板激活时显示鼠标

source: Display Errors
zh_cn: 显示错误

source: Display Grid
zh_cn: 显示网格

source: Display Mode
zh_cn: 显示模式

source: Display Name
zh_cn: 显示名称

source: Display Name:
zh_cn: 显示名：

source: Display a debug message in the output console.
zh_cn: 在输出控制台显示一条调试信息。

source: Display argument descriptions in status bar
zh_cn: 在状态栏中显示参数描述

source: Display argument types in status bar
zh_cn: 在状态栏中显示参数类型

source: Display cursor
zh_cn: 显示光标

source: Display cursor when touchpad is active
zh_cn: 触摸板激活时显示光标（cursor）

source: Display grid
zh_cn: 显示网格

source: Display name
zh_cn: 显示名称

source: Display name is invalid
zh_cn: 显示名称无效

source: Display name must be set
zh_cn: 显示名称必须设置。

source: Display name restrictions
zh_cn: 显示名称限制

source: Display only currently open windows
zh_cn: 仅显示当前打开的窗口

source: Display the virtual keyboard.
zh_cn: 显示虚拟键盘。

source: Distance Joints, Weld Joints and Wheel Joints
zh_cn: 距离关节、焊接关节与车轮关节

source: Distance in pixels the tab must be dragged before it will unmaximise the desktop
zh_cn: 在还没有最大化前选项卡必须拖拽的距离?

source: Distribution
zh_cn: 分布

source: Division and Modulo (div, %, mod)
zh_cn: 整除和取模(div, %, mod)

source: DnD Live Preview Window
zh_cn: DnD实时预览窗口

source: DnD™ Applies To
zh_cn: DnD™ 应用于

source: DnD™ Assign Variable
zh_cn: DnD™ 变量赋值（Assign Variable）

source: DnD™ Audio Actions Library
zh_cn: DnD™ 音频动作库

source: DnD™ Create Event
zh_cn: DnD™ 创建事件（Create Event）

source: DnD™ Editor
zh_cn: DnD™ 编辑器

source: DnD™ Maker
zh_cn: DnD™ 制作器

source: DnD™ Overview Screen
zh_cn: DnD™ 概述屏幕

source: DnD™ Preview
zh_cn: DnD™ 预览

source: DnD™ Properties Screen
zh_cn: DnD™ 属性屏幕

source: DnD™ Scope
zh_cn: DnD™ 作用域

source: DnD™ Set Direction Variable
zh_cn: DnD™ 设置方向变量（Set Direction Variable）

source: DnD™ Side Chain Of Actions
zh_cn: DnD™ 动作支链

source: DnD™ Target
zh_cn: DnD™ 目标变量

source: DnD™ chain of actions
zh_cn: DnD™ 动作链

source: DnD™ node overview visibility mode
zh_cn: DnD™节点概述可见模式

source: DnD™ side chain of actions
zh_cn: DnD™ 动作支链

source: DnD™ toolbox default location
zh_cn: DnD™工具栏默认位置

source: Do Effect
zh_cn: 产生特效

source: Do you really need a 48KHz sound effect that only plays for a fraction of a second?
zh_cn: 你真的需要一个只有几分之一秒的 48KHz 音效吗？

source: Do you want to add one now?
zh_cn: 你现在想添加一个吗？

source: Do you want to change your current runtime to version {0}?\nThis will require a restart of the IDE.
zh_cn: 你想要更换当前运行库版本为 {0} 吗？\n这将需要重启IDE。

source: Do you want to continue anyway?
zh_cn: 无论如何也要继续吗？

source: Do you want to continue?
zh_cn: 你想要继续吗？

source: Do you want to delete older runtimes from all feeds?
zh_cn: 是否要从所有Feed中删除较旧的运行库？

source: Do you want to do it anyway?
zh_cn: 无论如何也要这样做吗？

source: Do you want to open {0} resources for edit?
zh_cn: 您要打开{0}这些资源进行编辑吗？

source: Do you want to redistribute depths?
zh_cn: 你想要重新分配深度吗？

source: Do you want to restart now?
zh_cn: 是否要马上重启？

source: Do you want to save changes before exiting?
zh_cn: 退出前是否保存更改？

source: Do you want to save changes to the current project?
zh_cn: 是否保存对当前项目的更改？

source: Do you want to save the current library before continuing?
zh_cn: 在继续之前你想要保存当前的库吗？

source: Do you want to save?
zh_cn: 想要保存吗？

source: Do you want to try again?
zh_cn: 你想要重试吗？

source: Do you wish to replace ALL the frames with the dropped image files?
zh_cn: 你是否希望使用置入的图片文件替换所有帧？

source: Dock Tab{0}
zh_cn: 停靠栏选项卡{0}

source: DockTab{0}
zh_cn: 停靠栏{0}

source: Docking
zh_cn: 停靠栏

source: Docks
zh_cn: 停靠栏

source: Document line limit (<=0 no limit)
zh_cn: 文档行限制 (<=0 表示不限)

source: Domain
zh_cn: 域名

source: Don't show this message again
zh_cn: 此消息不再显示。

source: Done
zh_cn: 完成

source: Done.
zh_cn: 完成。

source: DotNet Install
zh_cn: DotNet 安装

source: Dots per inch (DPI) is a measure of spatial printing or video dot density, in particular the number of individual dots that can be placed in a line within the span of 1 inch (2.54 cm).
zh_cn: 每英寸打印的点数（DPI）是空间印刷或者视频点密度的量度，特别是指放置在一英寸（2.54 cm）直线跨度内的独立点的数目。

source: Double Tap
zh_cn: 双击

source: Double-click a resource in the Resource View to view its source code here
zh_cn: 双击资源视图中的资源以在此处查看其源代码

source: Double-click to go to this stack frame
zh_cn: 双击前往该栈帧(?)

source: Down
zh_cn: 下

source: Down Arrow
zh_cn: 方向键下

source: Download
zh_cn: 下载

source: Download cancelled
zh_cn: 取消下载

source: Download failed
zh_cn: 下载失败

source: Download now
zh_cn: 现在下载

source: Downloaded
zh_cn: 已下载

source: Downloaded Only
zh_cn: 仅下载

source: Downloading Manual
zh_cn: 正在下载帮助文档...

source: Downloading Manual...
zh_cn: 正在下载帮助文档...

source: Downloading...
zh_cn: 下载中...

source: Downloads
zh_cn: 下载

source: Drag And Drop Overview
zh_cn: 拖拽按钮概述

source: Drag And Drop Reference
zh_cn: 拖拽式操作参考

source: Drag End
zh_cn: 拖动结束

source: Drag Start
zh_cn: 拖动开始

source: Drag and Drop
zh_cn: 拖拽按钮（DnD）

source: Drag and Drop (DnD™)
zh_cn: 拖拽式操作 (DnD™)

source: Drag and Drop (DnD™) is ideal for beginners or those that are more visually or artistically orientated (this is sometimes called a "visual scripting language").
zh_cn: 拖拽式操作（DnD™）适合初学者或者那些视觉或艺术定位的开发者（这有时也可以称为“视觉脚本语方言”）。

source: Drag and Drop Overview
zh_cn: 拖拽按钮概览

source: Drag and Drop Overview Node
zh_cn: 拖拽按钮概览节点

source: Drag and Drop Preferences
zh_cn: 拖拽按钮的偏好设置

source: Drag and Drop...
zh_cn: 拖拽按钮功能（DnD）...

source: Drag and Drop™ Overview
zh_cn: Drag and Drop™ 概览

source: Dragging
zh_cn: 拖动

source: Draw
zh_cn: 绘制

source: Draw Background Colour
zh_cn: 绘制背景颜色

source: Draw Begin
zh_cn: 绘制开始

source: Draw Begin And Draw End
zh_cn: 开始绘制与结束绘制

source: Draw Ellipse
zh_cn: 绘制椭圆

source: Draw End
zh_cn: 绘制结束

source: Draw Event
zh_cn: 绘制事件

source: Draw Events
zh_cn: 绘制事件

source: Draw GUI
zh_cn: 绘制GUI

source: Draw GUI Begin
zh_cn: 绘制GUI开始

source: Draw GUI End
zh_cn: 绘制GUI结束

source: Draw GUI begin event
zh_cn: Draw GUI begin 事件

source: Draw GUI end event
zh_cn: Draw GUI end 事件

source: Draw GUI event
zh_cn: Draw GUI 事件

source: Draw Gradient Ellipse
zh_cn: 绘制渐变椭圆

source: Draw Gradient Rectangle
zh_cn: 绘制渐变矩形

source: Draw Healthbar
zh_cn: 绘制健康条

source: Draw Instance Health
zh_cn: 绘制实例健康值

source: Draw Instance Lives
zh_cn: 绘制实例生命数

source: Draw Instance Score
zh_cn: 绘制实例分数

source: Draw Line
zh_cn: 绘制线条

source: Draw Rectangle
zh_cn: 绘制矩形

source: Draw Self
zh_cn: 绘制自身

source: Draw Sprite
zh_cn: 绘制精灵

source: Draw Sprite Transformed
zh_cn: 绘制变形精灵

source: Draw Stacked Sprites
zh_cn: 绘制堆叠的精灵

source: Draw Transformed Value
zh_cn: 带形变的绘制值

source: Draw Value
zh_cn: 绘制值

source: Draw a gradient in a rectangular shape.
zh_cn: 在矩形中绘制渐变色。

source: Draw a gradient in an elliptical shape.
zh_cn: 在椭圆形中绘制渐变色。

source: Draw a healthbar from a 0-100 value.
zh_cn: 绘制值在0-100之间的健康条。

source: Draw a line.
zh_cn: 绘制一段线条。

source: Draw a rectangle.
zh_cn: 绘制一个矩形。

source: Draw a sprite multiple times in a stack.
zh_cn: 绘制堆叠在一起的多个精灵。

source: Draw a sprite with transformations.
zh_cn: 带有形变地绘制一个精灵。

source: Draw a sprite.
zh_cn: 绘制一个精灵。

source: Draw a value with a transformation.
zh_cn: 带形变（如缩放，旋转等）的方式绘制的值。

source: Draw an ellipse.
zh_cn: 绘制一个椭圆。

source: Draw an instance's health with a healthbar.
zh_cn: 使用健康条绘制一个实例的健康值变量。

source: Draw an instance's lives with stacked sprites.
zh_cn: 以堆叠精灵的方式绘制实例的生命数。

source: Draw an instance's score with a caption.
zh_cn: 绘制一个带有标签名头的实例分数。

source: Draw begin event
zh_cn: Draw begin 事件

source: Draw end event
zh_cn: Draw end 事件

source: Draw event
zh_cn: Draw 事件

source: Draw something into the image editor and take some time to play with the options, then when you are ready close the workspace (which will save the image) to take you back to the workspace with the sprite editor in it.
zh_cn: 在图像编辑器中绘制一些东西，花一些时间来熟悉这些选项，然后当你准备完成后关闭工作空间（这将保存图像），带你回到带有精灵编辑器的工作空间。

source: Draw the specified value.
zh_cn: 绘制特定的值。
